tap "homebrew/bundle"
tap "homebrew/services"
tap "zegervdv/zathura"
brew "python@3.12"
brew "gdk-pixbuf"
brew "librsvg"
brew "jpeg-xl"
brew "aom"
brew "dbus"
brew "bash"
brew "bat"
brew "grpc"
brew "bear"
brew "unbound"
brew "gnutls"
brew "tree-sitter"
brew "emacs"
brew "cask"
brew "cloc"
brew "cmatrix"
brew "csvlens"
brew "docker"
brew "doxygen"
brew "entr"
brew "ghostscript"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "gpgme"
brew "gtk+3"
brew "gtk-mac-integration"
brew "gspell"
brew "libhandy"
brew "poppler"
brew "evince"
brew "flex"
brew "fswatch"
brew "fzf"
brew "gcc@13"
brew "glow"
brew "gtk4"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "node"
brew "pandoc"
brew "jupyterlab"
brew "pkg-config"
brew "links"
brew "llvm"
brew "lolcat"
brew "neovim"
brew "newt"
brew "pandoc-crossref"
brew "pass"
brew "portaudio"
brew "python@3.11"
brew "rename"
brew "ripgrep"
brew "scdoc"
brew "socat"
brew "symlinks"
brew "tldr"
brew "tmux"
brew "trash"
brew "vte3"
brew "wget"
brew "xclip"
brew "zegervdv/zathura/zathura"
cask "cleanmymac"
cask "discord"
cask "firefox"
cask "karabiner-elements"
cask "kitty"
cask "mactex"
cask "monitorcontrol"
cask "nordvpn"
cask "obsidian"
cask "rectangle"
cask "skim"
cask "visual-studio-code"
cask "whatsapp"
cask "whisky"
vscode "catppuccin.catppuccin-vsc"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "mvllow.rose-pine"
vscode "redhat.java"
vscode "streetsidesoftware.code-spell-checker"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
