tap "dart-lang/dart"
tap "ddev/ddev"
tap "homebrew/bundle"
tap "homebrew/services"
tap "zegervdv/zathura"
brew "python@3.13"
brew "python@3.12"
brew "gdk-pixbuf"
brew "icu4c@76"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "ansible"
brew "jpeg-xl"
brew "aom"
brew "dbus"
brew "unbound"
brew "gnutls"
brew "tree-sitter"
brew "emacs"
brew "cask"
brew "cloc"
brew "cmatrix"
brew "csvlens"
brew "docker"
brew "enchant"
brew "flex"
brew "fzf"
brew "gcc@13"
brew "gh"
brew "ghostscript"
brew "glow"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "gpgme"
brew "openjdk"
brew "gradle"
brew "grpc"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "gspell"
brew "gtk-mac-integration"
brew "gtk4"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "libavif"
brew "libhandy"
brew "llvm"
brew "lua@5.3"
brew "luarocks"
brew "mariadb", restart_service: true
brew "neofetch"
brew "neovim"
brew "newt"
brew "node"
brew "pandoc"
brew "pandoc-crossref"
brew "pass"
brew "pkgconf"
brew "poppler"
brew "portaudio"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "scdoc"
brew "sdl2"
brew "sdl2_image"
brew "sdl2_ttf"
brew "socat"
brew "stow"
brew "tldr"
brew "tmux"
brew "vte3"
brew "wget"
brew "yarn"
brew "dart-lang/dart/dart"
brew "ddev/ddev/ddev"
cask "discord"
cask "docker"
cask "firefox"
cask "gitkraken"
cask "intellij-idea"
cask "karabiner-elements"
cask "kitty"
cask "monitorcontrol"
cask "nordvpn"
cask "obsidian"
cask "postman"
cask "postman-cli"
cask "rectangle"
cask "visual-paradigm-ce"
cask "visual-studio-code"
cask "whisky"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mvllow.rose-pine"
vscode "pkief.material-icon-theme"
vscode "postman.postman-for-vscode"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscodevim.vim"
