tap "homebrew/bundle"
tap "homebrew/services"
tap "zegervdv/zathura"
brew "librsvg"
brew "dbus"
brew "bash"
brew "bat"
brew "grpc"
brew "bear"
brew "unbound"
brew "emacs"
brew "cask"
brew "cloc"
brew "cmatrix"
brew "csvlens"
brew "docker"
brew "entr"
brew "gnupg"
brew "gpgme"
brew "gtk+3"
brew "gtk-mac-integration"
brew "gspell"
brew "libhandy"
brew "poppler"
brew "evince"
brew "fswatch"
brew "fzf"
brew "gcc@12"
brew "glow"
brew "pkg-config"
brew "python@3.12"
brew "htop"
brew "imagemagick"
brew "links"
brew "llvm"
brew "lolcat"
brew "mdless"
brew "neofetch"
brew "neovim"
brew "newt"
brew "node"
brew "pandoc"
brew "pandoc-crossref"
brew "pass"
brew "portaudio"
brew "python@3.11"
brew "rename"
brew "ripgrep"
brew "symlinks"
brew "tmux"
brew "trash"
brew "vte3"
brew "wget"
brew "xclip"
brew "zegervdv/zathura/zathura"
cask "balenaetcher"
cask "cheatsheet"
cask "cleanmymac"
cask "clion"
cask "discord"
cask "firefox"
cask "karabiner-elements"
cask "kitty"
cask "mactex"
cask "monitorcontrol"
cask "nordvpn"
cask "obsidian"
cask "rectangle"
cask "setapp"
cask "skim"
cask "visual-studio-code"
cask "whatsapp"
cask "whisky"
