tap "homebrew/bundle"
tap "homebrew/services"
# Library to render SVG files using Cairo
brew "librsvg"
# Message bus system, providing inter-application communication
brew "dbus"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generate compilation database for clang tooling
brew "bear"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Statistics utility to count lines of code
brew "cloc"
# Console Matrix
brew "cmatrix"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Run arbitrary commands when files change
brew "entr"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Flexible API to implement spellchecking in GTK+ applications
brew "gspell"
# Building blocks for modern adaptive GNOME apps
brew "libhandy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# GNOME document viewer
brew "evince"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# GNU compiler collection
brew "gcc@12"
# Render markdown on the CLI
brew "glow"
# Manage compile and link flags for libraries
brew "pkg-config"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Improved top (interactive process viewer)
brew "htop"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Next-gen compiler infrastructure
brew "llvm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Provides a formatted and highlighted view of Markdown files in Terminal
brew "mdless"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Library for color text mode, widget based user interfaces
brew "newt"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pandoc filter for numbering and cross-referencing
brew "pandoc-crossref"
# Password manager
brew "pass"
# Cross-platform library for audio I/O
brew "portaudio"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal-based client for Spotify
brew "spotify-tui"
# Spotify daemon
brew "spotifyd"
# Symbolic link maintenance utility
brew "symlinks"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Terminal emulator widget used by GNOME terminal
brew "vte3"
# Internet file retriever
brew "wget"
# Access X11 clipboards from the command-line
brew "xclip"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# C and C++ IDE
cask "clion"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# GPU-based terminal emulator
cask "kitty"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# VPN client for secure internet access and private browsing
cask "nordvpn"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Collection of apps available by subscription
cask "setapp"
# PDF reader and note-taking application
cask "skim"
# UML CASE Tool supporting UML 2, SysML and Business Process Modeling Notation
cask "visual-paradigm"
# Open-source code editor
cask "visual-studio-code"
# Web browser with built-in email client focusing on customization and control
cask "vivaldi"
# Native desktop client for WhatsApp
cask "whatsapp"
# Wine wrapper built with SwiftUI
cask "whisky"
# Multiplayer code editor
cask "zed"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "HarryHopkinson.vim-theme"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-repositories"
vscode "streetsidesoftware.code-spell-checker"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"
